export const initialPerformanceState = {
  subjectName: 'Финансовый анализ',
  students: [
    {
      name: 'Васильева Анна Игоревна',
      performance: {
        classes: [
          {
            date: '21.11.2021',
            name: 'Экономическая теория',
            score: 5,
          },
          {
            date: '21.11.2021',
            name: 'Финансовый и управленческий бухгалтерский учет',
            score: 5,
          },
          {
            date: '21.11.2021',
            name: 'Отечественные и зарубежные стандарты финансовой отчетности',
            score: 3,
          },
          {
            date: '21.11.2021',
            name: 'Анализ хозяйственной деятельности, аудит',
            score: 4,
          },
          {
            date: '21.11.2021',
            name: 'Финансовое управление',
            score: 2,
          },
        ],
      },
    },

    {
      name: 'Алейникова Вероника Дмитриевна',
      performance: {
        classes: [
          {
            date: '21.11.2021',
            name: 'Экономическая теория',
            score: 3,
          },
          {
            date: '21.11.2021',
            name: 'Финансовый и управленческий бухгалтерский учет',
            score: 4,
          },
          {
            date: '21.11.2021',
            name: 'Отечественные и зарубежные стандарты финансовой отчетности',
            score: 2,
          },
          {
            date: '21.11.2021',
            name: 'Анализ хозяйственной деятельности, аудит',
            score: 5,
          },
          {
            date: '21.11.2021',
            name: 'Финансовое управление',
            score: 5,
          },
        ],
      },
    },

    {
      name: 'Алейникова Вероника Дмитриевна',
      performance: {
        classes: [
          {
            date: '21.11.2021',
            name: 'Экономическая теория',
            score: 3,
          },
          {
            date: '21.11.2021',
            name: 'Финансовый и управленческий бухгалтерский учет',
            score: 4,
          },
          {
            date: '21.11.2021',
            name: 'Отечественные и зарубежные стандарты финансовой отчетности',
            score: 2,
          },
          {
            date: '21.11.2021',
            name: 'Анализ хозяйственной деятельности, аудит',
            score: 5,
          },
          {
            date: '21.11.2021',
            name: 'Финансовое управление',
            score: 5,
          },
        ],
      },
    },

    {
      name: 'Васильева Анна Игоревна',
      performance: {
        classes: [
          {
            date: '21.11.2021',
            name: 'Экономическая теория',
            score: 3,
          },
          {
            date: '21.11.2021',
            name: 'Финансовый и управленческий бухгалтерский учет',
            score: 4,
          },
          {
            date: '21.11.2021',
            name: 'Отечественные и зарубежные стандарты финансовой отчетности',
            score: 2,
          },
          {
            date: '21.11.2021',
            name: 'Анализ хозяйственной деятельности, аудит',
            score: 5,
          },
          {
            date: '21.11.2021',
            name: 'Финансовое управление',
            score: 5,
          },
        ],
      },
    },

    {
      name: 'Алейникова Вероника Дмитриевна',
      performance: {
        classes: [
          {
            date: '21.11.2021',
            name: 'Экономическая теория',
            score: 3,
          },
          {
            date: '21.11.2021',
            name: 'Финансовый и управленческий бухгалтерский учет',
            score: 4,
          },
          {
            date: '21.11.2021',
            name: 'Отечественные и зарубежные стандарты финансовой отчетности',
            score: 2,
          },
          {
            date: '21.11.2021',
            name: 'Анализ хозяйственной деятельности, аудит',
            score: 5,
          },
          {
            date: '21.11.2021',
            name: 'Финансовое управление',
            score: 5,
          },
        ],
      },
    },

    {
      name: 'Алейникова Вероника Дмитриевна',
      performance: {
        classes: [
          {
            date: '21.11.2021',
            name: 'Экономическая теория',
            score: 3,
          },
          {
            date: '21.11.2021',
            name: 'Финансовый и управленческий бухгалтерский учет',
            score: 4,
          },
          {
            date: '21.11.2021',
            name: 'Отечественные и зарубежные стандарты финансовой отчетности',
            score: 2,
          },
          {
            date: '21.11.2021',
            name: 'Анализ хозяйственной деятельности, аудит',
            score: 5,
          },
          {
            date: '21.11.2021',
            name: 'Финансовое управление',
            score: 5,
          },
        ],
      },
    },
  ],
};


export const initialClassesListState = {
  classes: [
    {
      date: '21.11.2021',
      name: 'Экономическая теория',
    },
    {
      date: '21.11.2021',
      name: 'Финансовый и управленческий бухгалтерский учет',
    },
    {
      date: '21.11.2021',
      name: 'Отечественные и зарубежные стандарты финансовой отчетности',
    },
    {
      date: '21.11.2021',
      name: 'Анализ хозяйственной деятельности, аудит',
    },
    {
      date: '21.11.2021',
      name: 'Финансовое управление',
    },
  ],
};
